<h1 style="font-family:Impact,Arial;font-size:70px;">Introduction to pandas</h1>
<h2 style="font-familﬁy:Arial;">Matias Quiroz (original: Adel Rahmani)</h2>
<p><small> School of Mathematical &amp; Physical Sciences<br>
University of Technology Sydney
</small></p>
<p>
<a href="mailto:matias.quiroz@uts.edu.au" target="_blank">
<small><font color=MediumVioletRed>matias.quiroz@uts.edu.au</font></small></a>
</p>
<hr style="height:5px;border:none;color:#333;background-color:#333;" />

<div style="background-color:#F2FBEF;">
<h2><font color=#04B404>After completing this notebook you should:</font></h2>
<br>
<ul>
<li> Be familiar with the <code>pandas</code> Dataframe data structure. </li><br>
<li> Be familiar with dataframe methods and their applications to tabular data. </li><br>
</ul>
</div>

<div style="background-color:#ADD8E6;">
<h2><font color=#00008B>Suggested way of working with the lecture notebooks:</font></h2>
<br>

<ul>
<li> Open a new empty notebook document through `File->New Notebook->Python 3 (ipykernel)` (or similar depending on version).</li><br>
<li> Keep two documents open. This notebook (or its HTML version) and the notebook you created above. </li><br>
<li> Type your solutions/code in the notebook you created. Avoid copy-pasting as much as possible: You need to develop the "muscle memory" that comes with writing code.</li><br>
</ul>
</div>

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Note:</font> </h3>
Henceforth we will refer to <em>Wes McKinney</em>'s book <b>Python for Data Analysis, 2nd edition</b> as <b>PDA</b>.<br>

(The page numbers refer to the PDF version of the ebook.)

<a href="http://pandas.pydata.org/"><img src="https://covers.oreillystatic.com/images/0636920050896/lrg.jpg" width="150" ></a> <br>

The datasets used in the book are available from <a href="https://github.com/pydata/pydata-book">this GitHub page</a>.<br>

<p>If you want to download the entire repository to your computer you can use <code>git</code> to do it.<br> 

In the <code>Terminal</code> (or the command line console in Windows), go to the directory where you want to download the repository and enter:</p>
<pre><code>git clone https://github.com/pydata/pydata-book.git</code></pre>
<p>You should be able to access the book via the <a href="https://search.lib.uts.edu.au/permalink/61UTS_INST/ihv95n/alma991006753456605671">UTS Library</a></p>    
<br>
</div>

<hr style="height:5px;border:none;color:#333;background-color:#333;" />
<h1> 1. Introduction</h1>
<p>We have seen that NumPy provides an array datatype that is much better suited for numerical computation than the Python <code>list</code>.
NumPy array are efficient and fast, and they come with a myriad of built-in functions that allow us to do powerful things with
very little code. However, there is still a lot we have to take care of. For example,
recall how we had to sort the rainfall data using NumPy by splitting it into 2 arrays and computing the index of the sorted array ourselves. Pandas makes this sort of thing trivial by providing a highly efficient framework for <b>data wrangling</b>.</p>

From <b>PDA</b> p14
<blockquote>
    <b>Munge/munging/wrangling</b><br>
    Describes the overall process of manipulating unstructured and/or messy data into a structured or clean form. The word has snuck its way into the jargon of many modern-day data hackers. “Munge” rhymes with “grunge.”
</blockquote>

Pandas allows us to have different datatypes in each column and has some advanced features to deal with missing values. 
From the <a href="http://pandas.pydata.org/">Pandas website</a>, the library provides: 

<blockquote>
<ul>
<li>A <b>fast</b> and <b>efficient DataFrame object</b> for data manipulation with integrated indexing;

<li><b>Tools for reading and writing data</b> between in-memory data structures and different formats, including CSV and text files, Microsoft Excel, SQL databases, and the fast HDF5 format;

<li>Intelligent data alignment and <b>integrated handling of missing data</b>: gain automatic label-based alignment in computations and easily manipulate messy data into an orderly form;

<li>Flexible <b>reshaping</b> and <b>pivoting</b> of data sets;

<li>Intelligent label-based slicing, <b>fancy indexing</b>, and subsetting of large data sets;

<li>Columns can be inserted and deleted from data structures for <b>size mutability</b>;

<li>Aggregating or transforming data with a <b>powerful group by engine allowing split-apply-combine operations</b> on data sets;

<li>High performance <b>merging and joining</b> of data sets;

<li>Hierarchical axis indexing provides an <b>intuitive way of working with high-dimensional data</b> in a lower-dimensional data structure;

<li><b>Time series functionality</b>: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging. Even create domain-specific time offsets and join time series without losing data;

<li>Highly <b>optimized for performance</b>, with critical code paths written in Cython or C.

<li>Python with pandas is <b>in use in a wide variety of academic and commercial domains</b>, including Finance, Neuroscience, Economics, Statistics, Advertising, Web Analytics, and more.
</ul>
</blockquote>


<div style="background-color:#FBEFFB;">
<p style="font-size:18px;color:#FF0080;">&#0; Why should you care about data wrangling?</p>

<p>Do you think that data analysis at its core is about using the latest statistical modelling technique, or applying some fancy
algorithm to a nice dataset? It is not. </p>

<p>In a typical, <em>real-world</em> data analysis project you will spend the <b>majority of your time</b> checking, cleaning, exploring the data. It is quite common to spend 80% or 90% of your time on the project preparing the data, both before you run your fancy mathematical or statistical model, when you are trying to gain insight in the data, or test its integrity (sanity checks), and after, when you are trying to interpret, visualise and communicate the results of your analysis.</p>

<p>Therefore, the take home message is that, you can expect data munging/wrangling to make up about 80% of your time on a data analysis project.<sup><a href="#fn1" id="ref1">1</a></sup> That is why you should learn Pandas, it will make your work a lot easier. </p>

</div>

<br>
<div style="background-color:#F2FBEF;">
<p style="font-size:20px;color:#4E9258">&#9786; Tips &amp; Tricks:</p> <!--- Smiley --->
You can access the <code>pandas</code> reference documentation from the <b>Help</b> menu at the top
of the notebook.
</div>

<sup id="fn1">[1] Although according to <a href="https://twitter.com/BigDataBorat/status/306596352991830016">Big Data Borat</a>, the rule should be <em>In Data Science, 80% of time spent prepare data, 20% of time spent complain about need for prepare data</em>... It is on social media so it must be true.<a href="#ref1" title="Back to where we were.">&crarr;</a></sup>

<hr style="height:5px;border:none;color:#333;background-color:#333;" />
<h1> 2. Pandas Dataframe</h1>

We import pandas and rename it to the standard, shorter name `pd` using:
```python
    import pandas as pd
```

In [1]:
from math import *
import numpy as np
import pandas as pd
from pathlib import Path

#### Pandas has 2 main data structures, the `Series` and the `Dataframe`. 
(There is also a Panel data structure but we will not be talking about it. See PDA for more information.)

#### A pandas `Series` can be thought of a `numpy array` with an index. 
(let us set the seed so that we all have the same random numbers.)

In [2]:
np.random.seed(12345)
A = np.random.randint(1, 100, 5)
A

array([99, 30,  2, 37, 42])

In [3]:
s = pd.Series(data = A)
s

0    99
1    30
2     2
3    37
4    42
dtype: int32

In [4]:
# the 'data' keyword is optional.
s = pd.Series(A)
s

0    99
1    30
2     2
3    37
4    42
dtype: int32

The index is a special type of object (created by the author of pandas). By default it contains a sequence (range) of integers starting at 0.

In [5]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
print([item for item in dir(s.index) if not item.startswith('_')])

['T', 'all', 'any', 'append', 'argmax', 'argmin', 'argsort', 'array', 'asi8', 'asof', 'asof_locs', 'astype', 'copy', 'delete', 'difference', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'duplicated', 'empty', 'equals', 'factorize', 'fillna', 'format', 'from_range', 'get_indexer', 'get_indexer_for', 'get_indexer_non_unique', 'get_level_values', 'get_loc', 'get_slice_bound', 'get_value', 'groupby', 'has_duplicates', 'hasnans', 'holds_integer', 'identical', 'inferred_type', 'insert', 'intersection', 'is_', 'is_all_dates', 'is_boolean', 'is_categorical', 'is_floating', 'is_integer', 'is_interval', 'is_mixed', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_numeric', 'is_object', 'is_type_compatible', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'join', 'map', 'max', 'memory_usage', 'min', 'name', 'names', 'nbytes', 'ndim', 'nlevels', 'notna', 'notnull', 'nunique', 'putmask', 'ravel', 'reindex', 'rename', 'repeat', 'searchsorted', 'set_names', 'shape', 'shift', 'size', 'slice_indexer', 'slice_locs', 'sort', 'sort_values', 'sortlevel', 'start', 'step', 'stop', 'symmetric_difference', 'take', 'to_flat_index', 'to_frame', 'to_list', 'to_native_types', 'to_numpy', 'to_series', 'transpose', 'union', 'unique', 'value_counts', 'values', 'view', 'where']

An index can be passed on when the Series is created, or later. When creating the series object:

In [7]:
s = pd.Series(data = A, index=['January', 'February', 'March', 'April', 'May'])
s

January     99
February    30
March        2
April       37
May         42
dtype: int32

In [8]:
s.index

Index(['January', 'February', 'March', 'April', 'May'], dtype='object')

After the series object has been created:

In [9]:
s = pd.Series(data = A)
print(s.index)
s.index = ['January', 'February', 'March', 'April', 'May']
print(s.index)

RangeIndex(start=0, stop=5, step=1)
Index(['January', 'February', 'March', 'April', 'May'], dtype='object')

#### We can select rows using a positional argument...

In [10]:
s[:2]

January     99
February    30
dtype: int32

#### ... or by name

In [11]:
s[:'March']

January     99
February    30
March        2
dtype: int32

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Note:</font> </h3>
Notice how slicing using names will <b>include</b> the last item listed.
</div>

<div style="background-color:#F7F2E0;">
<h1> <font color=MediumVioletRed>Practice makes perfect.</font></h1>
<ul>
<li>Create a pandas <code>Series</code> where the index holds the integers 1 to 7 and the values are the strings <code>"Monday"</code> to <code>"Sunday"</code>.</li><br>
<li>Create a pandas <code>Series</code> where the index holds the strings <code>"Monday"</code> to <code>"Sunday"</code> and the values are the integers 1 to 7.</li><br>
</ul>
</div>

#### The pandas `Series` is built on the `numpy` array but has additional features that are designed to help manipulate data more efficiently.

In [12]:
spd = set([item for item in dir(pd.Series())  if not item.startswith('_')])
snp = set([item for item in dir(np.array([])) if not item.startswith('_')])

print("""
Pandas Series have {:d} methods and attributes, \n
Numpy arrays have {:d} methods and attributes.\n
{:d} features of arrays are found in Series,\n
{:d} of Series features are not found in arrays.
""".format(len(spd), len(snp), len(spd.intersection(snp)), len(spd.difference(snp))))

Pandas Series have 207 methods and attributes,

Numpy arrays have 71 methods and attributes.

35 features of arrays are found in Series,

172 of Series features are not found in arrays.

C:\Users\144052\AppData\Local\Temp\ipykernel_11460\479350542.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  spd = set([item for item in dir(pd.Series())  if not item.startswith('_')])

In [13]:
print(spd.difference(snp))

{'droplevel', 'corr', 'update', 'set_flags', 'combine_first', 'at', 'ffill', 'dtypes', 'bool', 'count', 'isnull', 'last', 'factorize', 'eq', 'to_sql', 'expanding', 'sample', 'drop_duplicates', 'le', 'to_dict', 'first_valid_index', 'add_suffix', 'dropna', 'drop', 'set_axis', 'kurt', 'tz_localize', 'equals', 'is_monotonic_decreasing', 'pipe', 'to_xarray', 'unique', 'abs', 'cummin', 'nunique', 'rdiv', 'pop', 'unstack', 'divide', 'is_monotonic', 'attrs', 'hasnans', 'filter', 'multiply', 'bfill', 'iteritems', 'to_timestamp', 'pow', 'sem', 'to_latex', 'rolling', 'rmod', 'backfill', 'where', 'reorder_levels', 'swaplevel', 'value_counts', 'xs', 'head', 'last_valid_index', 'pad', 'get', 'to_frame', 'empty', 'rtruediv', 'is_monotonic_increasing', 'axes', 'reset_index', 'agg', 'asfreq', 'notna', 'to_numpy', 'loc', 'isna', 'radd', 'groupby', 'between_time', 'truncate', 'at_time', 'to_period', 'idxmax', 'cummax', 'mask', 'map', 'nsmallest', 'pct_change', 'reindex', 'skew', 'ewm', 'aggregate', 'rmul', 'rank', 'combine', 'to_csv', 'sort_index', 'add', 'to_hdf', 'nlargest', 'sub', 'reindex_like', 'subtract', 'tz_convert', 'isin', 'replace', 'to_clipboard', 'mad', 'to_pickle', 'keys', 'diff', 'lt', 'convert_dtypes', 'is_unique', 'explode', 'first', 'kurtosis', 'ne', 'rsub', 'iloc', 'cov', 'fillna', 'gt', 'values', 'index', 'compare', 'quantile', 'array', 'memory_usage', 'truediv', 'apply', 'duplicated', 'iat', 'between', 'notnull', 'ge', 'rename', 'infer_objects', 'resample', 'shift', 'mode', 'rename_axis', 'describe', 'rpow', 'hist', 'sort_values', 'to_list', 'transform', 'median', 'asof', 'mod', 'rdivmod', 'slice_shift', 'to_json', 'idxmin', 'to_excel', 'floordiv', 'interpolate', 'items', 'align', 'mul', 'name', 'divmod', 'plot', 'autocorr', 'to_string', 'rfloordiv', 'div', 'add_prefix', 'to_markdown', 'append', 'info', 'product', 'tail'}

#### We will meet Pandas `Series` again later. For the moment we will focus on the `Dataframe`.

<h3> <center><font color=MediumVioletRed>A. Basic operations.</font></center></h3>

You can think of a dataframe as a <b>collection of <code>Series</code> sharing the same index</b>. 

A dataframe has rows and columns, and is ideal for representing all sorts of <b>tabular</b> data (e.g., spreadsheet data).

Let us create 2 simple dataframes to illustrate how things work.

In [14]:
df1 = pd.DataFrame({"x":[1, 2, 3, 4, 5], 
                    "y":[3, 4, 5, 6, 7]}, 
                   index=['a', 'b', 'c', 'd', 'e'])


df2 = pd.DataFrame({"y":[1, 3, 5, 7, 9], 
                    "z":[9, 8, 7, 6, 5]}, 
                   index=['b', 'c', 'd', 'e', 'f'])

display(df1)
display(df2)

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Note:</font> </h3>
    <p>Notice how we used <code>display</code> instead of <code>print</code> to output the dataframes.</p>
    <p>That is because while the notebook will perform some nice rendering of the dataframe if its the last variable listed in the cell, when more than one dataframe is being output, we need to explicitely tell Python to print the results and the <code>print</code> function only outputs a "barebone" representation of the dataframe.</p> 
</div>

In [15]:
# This output is not as pretty as display
print(df1)
print(df2)

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7
   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

In [16]:
spd = set([item for item in dir(pd.DataFrame())  if not item.startswith('_')])
sps = set([item for item in dir(pd.Series())     if not item.startswith('_')])

print("Properties of Series not in Dataframe: ", "\n", sps.difference(spd))
print()
print("Properties of Dataframe not in Series: ", "\n", spd.difference(sps))

Properties of Series not in Dataframe:
 {'searchsorted', 'between', 'is_monotonic', 'hasnans', 'to_list', 'ravel', 'argsort', 'rdivmod', 'factorize', 'to_frame', 'argmax', 'is_monotonic_increasing', 'is_unique', 'nbytes', 'argmin', 'item', 'name', 'view', 'divmod', 'autocorr', 'is_monotonic_decreasing', 'dtype', 'unique', 'map', 'array', 'repeat'}

Properties of Dataframe not in Series:
 {'assign', 'to_gbq', 'to_stata', 'style', 'lookup', 'sparse', 'query', 'isetitem', 'eval', 'from_records', 'to_html', 'join', 'stack', 'applymap', 'itertuples', 'insert', 'corrwith', 'melt', 'to_feather', 'pivot_table', 'pivot', 'set_index', 'to_parquet', 'columns', 'merge', 'iterrows', 'to_orc', 'to_xml', 'select_dtypes', 'to_records', 'boxplot', 'from_dict'}

C:\Users\144052\AppData\Local\Temp\ipykernel_11460\2585554414.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  sps = set([item for item in dir(pd.Series())     if not item.startswith('_')])

### There are several ways to access the data.
#### You can use a column name (all the following syntaxes are equivalent)

In [17]:
df1['x']

a    1
b    2
c    3
d    4
e    5
Name: x, dtype: int64

In [18]:
df1.x

a    1
b    2
c    3
d    4
e    5
Name: x, dtype: int64

In [19]:
df1.loc[:,'x']

a    1
b    2
c    3
d    4
e    5
Name: x, dtype: int64

#### Or you can use the column's index

In [20]:
df1.iloc[:, 0]

a    1
b    2
c    3
d    4
e    5
Name: x, dtype: int64

#### Note that we get back a `Series` object. If we only want the values and not the index we should use the `values` attribute.

In [21]:
type(df1['x'])

pandas.core.series.Series

In [22]:
df1['x'].values

array([1, 2, 3, 4, 5], dtype=int64)

#### Note that if you use double brackets you get a one-column dataframe instead of a series.

In [23]:
type(df1[['x']])

pandas.core.frame.DataFrame

In [24]:
display(df1['x'])
display(df1[['x']])

a    1
b    2
c    3
d    4
e    5
Name: x, dtype: int64

   x
a  1
b  2
c  3
d  4
e  5

In [25]:
df1[['x']].values

array([[1],
       [2],
       [3],
       [4],
       [5]], dtype=int64)

#### You can use a row position or name.

In [26]:
# position only
df1.iloc[2]

x    3
y    5
Name: c, dtype: int64

In [27]:
# name only
df1.loc['c']

x    3
y    5
Name: c, dtype: int64

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Remark:</font> </h3>

<p>Why so many different indexing methods?</p>
<p>Read the <a href="http://pandas.pydata.org/pandas-docs/stable/indexing.html#different-choices-for-indexing">relevant section of the official documentation</a>, but in short to access elements by <b>name</b> use <code>loc</code>, and when accessing elements by <b>index</b> use <code>iloc</code>.</p> 
</div>

In [28]:
df1

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

#### You can use slicing

In [29]:
# Notice how the last value is NOT included
df1.iloc[:2]

   x  y
a  1  3
b  2  4

In [30]:
# Notice how the last value IS included
df1.loc[:'b']

   x  y
a  1  3
b  2  4

In [31]:
df1.loc[['e', 'c', 'b'], ['y', 'x']]

   y  x
e  7  5
c  5  3
b  4  2

In [32]:
df1.loc[['e', 'c', 'b'], ['x']]

   x
e  5
c  3
b  2

In [33]:
df1.iloc[::-2, [1, 0]]

   y  x
e  7  5
c  5  3
a  3  1

#### You can select elements using a list (or an array) as an index.

In [34]:
df1

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

#### For position based indexing use  `.iloc`.

In [35]:
ind = [0, 4, 4, 4, 2, 2, 1, 0]

cols = [0, 1, 1, 1, 0, 0]

df1.iloc[ind, cols]

   x  y  y  y  x  x
a  1  3  3  3  1  1
e  5  7  7  7  5  5
e  5  7  7  7  5  5
e  5  7  7  7  5  5
c  3  5  5  5  3  3
c  3  5  5  5  3  3
b  2  4  4  4  2  2
a  1  3  3  3  1  1

#### For label based indexing use `.loc`.

In [36]:
ind = ['a', 'c', 'd', 'd', 'b', 'b', 'a', 'e']

cols = ['y', 'y', 'x', 'y', 'x', 'x']

df1.loc[ind, cols]

   y  y  x  y  x  x
a  3  3  1  3  1  1
c  5  5  3  5  3  3
d  6  6  4  6  4  4
d  6  6  4  6  4  4
b  4  4  2  4  2  2
b  4  4  2  4  2  2
a  3  3  1  3  1  1
e  7  7  5  7  5  5

<div style="background-color:#FBEFFB;"><p style="font-size:20px;color:#FF0080">&#9888; Stop and think!</p> <!--- Warning --->
Make sure you understand how the previous selections work.
</div>

#### Arithmetic operations are automatically aligned on the index.
Missing values are replaced by `NaN` (not a number).

In [37]:
df1

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

In [38]:
df2

   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

In [39]:
df1 + df2

    x     y   z
a NaN   NaN NaN
b NaN   5.0 NaN
c NaN   8.0 NaN
d NaN  11.0 NaN
e NaN  14.0 NaN
f NaN   NaN NaN

In [40]:
df1 * df2

    x     y   z
a NaN   NaN NaN
b NaN   4.0 NaN
c NaN  15.0 NaN
d NaN  30.0 NaN
e NaN  49.0 NaN
f NaN   NaN NaN

In [41]:
df1 / df2

    x         y   z
a NaN       NaN NaN
b NaN  4.000000 NaN
c NaN  1.666667 NaN
d NaN  1.200000 NaN
e NaN  1.000000 NaN
f NaN       NaN NaN

#### Dataframes can be combined in several ways.

They can be concatenated (remember `numpy`'s `hstack` and `vstack`?)
Note that `concat` takes a __sequence__ of dataframes as arguments.

In [42]:
display(df1)
display(df2)
# vertically
pd.concat([df1, df2], axis=0, sort=False)

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

     x  y    z
a  1.0  3  NaN
b  2.0  4  NaN
c  3.0  5  NaN
d  4.0  6  NaN
e  5.0  7  NaN
b  NaN  1  9.0
c  NaN  3  8.0
d  NaN  5  7.0
e  NaN  7  6.0
f  NaN  9  5.0

In [43]:
#horizontally
pd.concat([df1, df2], axis=1, sort=False)

     x    y    y    z
a  1.0  3.0  NaN  NaN
b  2.0  4.0  1.0  9.0
c  3.0  5.0  3.0  8.0
d  4.0  6.0  5.0  7.0
e  5.0  7.0  7.0  6.0
f  NaN  NaN  9.0  5.0

#### At first, it can be a bit hard to remember that <code>axis=0</code> means along the rows and <code>axis=1</code> means along the columns, so there is a more explicit syntax.

In [44]:
# vertically
pd.concat([df1, df2], axis='rows', sort=False)

     x  y    z
a  1.0  3  NaN
b  2.0  4  NaN
c  3.0  5  NaN
d  4.0  6  NaN
e  5.0  7  NaN
b  NaN  1  9.0
c  NaN  3  8.0
d  NaN  5  7.0
e  NaN  7  6.0
f  NaN  9  5.0

In [45]:
#horizontally
pd.concat([df1, df2], axis='columns', sort=False)

     x    y    y    z
a  1.0  3.0  NaN  NaN
b  2.0  4.0  1.0  9.0
c  3.0  5.0  3.0  8.0
d  4.0  6.0  5.0  7.0
e  5.0  7.0  7.0  6.0
f  NaN  NaN  9.0  5.0

#### Notice that the index or column entries need not be unique

In [46]:
pd.concat([df1, df2], axis=0, sort=False).index.is_unique

False

In [47]:
pd.concat([df1, df2], axis=0, sort=False).loc["b"]

     x  y    z
b  2.0  4  NaN
b  NaN  1  9.0

We can tell concat to only consider columns or rows that are found in both dataframes.

In [48]:
display(df1)
display(df2)
pd.concat([df1, df2], join='inner') # by default axis=0 or 'rows'

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

   y
a  3
b  4
c  5
d  6
e  7
b  1
c  3
d  5
e  7
f  9

In [49]:
pd.concat([df1, df2], join='inner', axis='columns')

   x  y  y  z
b  2  4  1  9
c  3  5  3  8
d  4  6  5  7
e  5  7  7  6

#### Dataframes can be merged
The merge is done by default using the values within the __columns that are found in both dataframes__.

In [50]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left: 'DataFrame | Series', right: 'DataFrame | Series', how: 'str' = 'inner', on: 'IndexLabel | None' = None, left_on: 'IndexLabel | None' = None, right_on: 'IndexLabel | None' = None, left_index: 'bool' = False, right_index: 'bool' = False, sort: 'bool' = False, suffixes: 'Suffixes' = ('_x', '_y'), copy: 'bool' = True, indicator: 'bool' = False, validate: 'str | None' = None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    A named Series object is treated as a DataFrame with a single named column.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.
    When performing a cross merge, no column specifications to merge on are
    allowed.

    .. warning::

        If both key columns contain rows where the key is a null value, those
        rows will be matched against each other. This is different from usual SQL
        join behaviour and can lead to unexpected results.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
        * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.

          .. versionadded:: 1.2.0

    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : list-like, default is ("_x", "_y")
        A length-2 sequence where each element is optionally a string
        indicating the suffix to add to overlapping column names in
        `left` and `right` respectively. Pass a value of `None` instead
        of a string to indicate that the column name from `left` or
        `right` should be left as-is, with no suffix. At least one of the
        values must not be None.
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to the output DataFrame called "_merge" with
        information on the source of each row. The column can be given a different
        name by providing a string argument. The column will have a Categorical
        type with the value of "left_only" for observations whose merge key only
        appears in the left DataFrame, "right_only" for observations
        whose merge key only appears in the right DataFrame, and "both"
        if the observation's merge key is found in both DataFrames.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------
    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

    >>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
    >>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
    >>> df1
          a  b
    0   foo  1
    1   bar  2
    >>> df2
          a  c
    0   foo  3
    1   baz  4

    >>> df1.merge(df2, how='inner', on='a')
          a  b  c
    0   foo  1  3

    >>> df1.merge(df2, how='left', on='a')
          a  b  c
    0   foo  1  3.0
    1   bar  2  NaN

    >>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
    >>> df2 = pd.DataFrame({'right': [7, 8]})
    >>> df1
        left
    0   foo
    1   bar
    >>> df2
        right
    0   7
    1   8

    >>> df1.merge(df2, how='cross')
       left  right
    0   foo      7
    1   foo      8
    2   bar      7
    3   bar      8

In [51]:
df1

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

In [52]:
df2

   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

In [53]:
display(pd.merge(df1, df2))
# This is the same as
display(pd.merge(df1, df2, how='inner'))

   x  y  z
0  1  3  8
1  3  5  7
2  5  7  6

   x  y  z
0  1  3  8
1  3  5  7
2  5  7  6

#### Notice that the index has been set to the default `[0, 1, 2,...]`.

In [54]:
display(df1)
display(df2)
pd.merge(df1, df2, how='outer')

   x  y
a  1  3
b  2  4
c  3  5
d  4  6
e  5  7

   y  z
b  1  9
c  3  8
d  5  7
e  7  6
f  9  5

     x  y    z
0  1.0  3  8.0
1  2.0  4  NaN
2  3.0  5  7.0
3  4.0  6  NaN
4  5.0  7  6.0
5  NaN  1  9.0
6  NaN  9  5.0

In [55]:
pd.merge(df1, df2, how='right')

     x  y  z
0  NaN  1  9
1  1.0  3  8
2  3.0  5  7
3  5.0  7  6
4  NaN  9  5

In [56]:
pd.merge(df1, df2, how='left')

   x  y    z
0  1  3  8.0
1  2  4  NaN
2  3  5  7.0
3  4  6  NaN
4  5  7  6.0

Let us go back to the outer merge

In [57]:
df = pd.merge(df1, df2, how='outer')
df

     x  y    z
0  1.0  3  8.0
1  2.0  4  NaN
2  3.0  5  7.0
3  4.0  6  NaN
4  5.0  7  6.0
5  NaN  1  9.0
6  NaN  9  5.0

#### Dataframes can easily be converted to dictionaries

In [58]:
df.to_dict()

{'x': {0: 1.0, 1: 2.0, 2: 3.0, 3: 4.0, 4: 5.0, 5: nan, 6: nan},
 'y': {0: 3, 1: 4, 2: 5, 3: 6, 4: 7, 5: 1, 6: 9},
 'z': {0: 8.0, 1: nan, 2: 7.0, 3: nan, 4: 6.0, 5: 9.0, 6: 5.0}}

#### Missing values are handled nicely across a wide range of operations.

In [59]:
# Let us reload our dataframe from its dictionary version. 
# Notice how we have specified missing values as np.nan instead of just nan.

d = {'x': {0: 1.0, 1: 2.0, 2: 3.0, 3: 4.0, 4: 5.0, 5: np.nan, 6: np.nan},
     'y': {0: 3.0, 1: 4.0, 2: 5.0, 3: 6.0, 4: 7.0, 5: 1.0, 6: 9.0},
     'z': {0: 8.0, 1: np.nan, 2: 7.0, 3: np.nan, 4: 6.0, 5: 9.0, 6: 5.0}}

df = pd.DataFrame(d)
df

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  NaN
2  3.0  5.0  7.0
3  4.0  6.0  NaN
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

In [60]:
# Number of values in each column, excluding missing values
df.count()

x    5
y    7
z    5
dtype: int64

In [61]:
# Basic stats on the columns
df.describe()

              x         y         z
count  5.000000  7.000000  5.000000
mean   3.000000  5.000000  7.000000
std    1.581139  2.645751  1.581139
min    1.000000  1.000000  5.000000
25%    2.000000  3.500000  6.000000
50%    3.000000  5.000000  7.000000
75%    4.000000  6.500000  8.000000
max    5.000000  9.000000  9.000000

In [62]:
# Multiply every element by a constant
df * 2

      x     y     z
0   2.0   6.0  16.0
1   4.0   8.0   NaN
2   6.0  10.0  14.0
3   8.0  12.0   NaN
4  10.0  14.0  12.0
5   NaN   2.0  18.0
6   NaN  18.0  10.0

In [63]:
# Mean along the rows (for each column)
df.mean()

x    3.0
y    5.0
z    7.0
dtype: float64

In [64]:
# Mean along the columns (for each row)
df.mean(axis='columns')

0    4.0
1    3.0
2    5.0
3    5.0
4    6.0
5    5.0
6    7.0
dtype: float64

#### We can drop missing values

In [65]:
df

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  NaN
2  3.0  5.0  7.0
3  4.0  6.0  NaN
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

In [66]:
# by rows
df.dropna()

     x    y    z
0  1.0  3.0  8.0
2  3.0  5.0  7.0
4  5.0  7.0  6.0

Note that the above is not an inplace operation. If we want the inplace change we need to specify it.

In [67]:
display(df)
df.dropna(inplace = True)
display(df)

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  NaN
2  3.0  5.0  7.0
3  4.0  6.0  NaN
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

     x    y    z
0  1.0  3.0  8.0
2  3.0  5.0  7.0
4  5.0  7.0  6.0

Reset the data frame to continue.

In [68]:
d = {'x': {0: 1.0, 1: 2.0, 2: 3.0, 3: 4.0, 4: 5.0, 5: np.nan, 6: np.nan},
     'y': {0: 3.0, 1: 4.0, 2: 5.0, 3: 6.0, 4: 7.0, 5: 1.0, 6: 9.0},
     'z': {0: 8.0, 1: np.nan, 2: 7.0, 3: np.nan, 4: 6.0, 5: 9.0, 6: 5.0}}

df = pd.DataFrame(d)
df

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  NaN
2  3.0  5.0  7.0
3  4.0  6.0  NaN
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

In [69]:
# drop na by columns
df.dropna(axis='columns')

     y
0  3.0
1  4.0
2  5.0
3  6.0
4  7.0
5  1.0
6  9.0

#### We can fill in missing values by replacing them with anything we want.

In [70]:
df.fillna(0)

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  0.0
2  3.0  5.0  7.0
3  4.0  6.0  0.0
4  5.0  7.0  6.0
5  0.0  1.0  9.0
6  0.0  9.0  5.0

#### and by that, I do mean _anything we want_...

In [71]:
df.fillna("missing" )

         x    y        z
0      1.0  3.0      8.0
1      2.0  4.0  missing
2      3.0  5.0      7.0
3      4.0  6.0  missing
4      5.0  7.0      6.0
5  missing  1.0      9.0
6  missing  9.0      5.0

#### We can fill in missing values by filling in the blanks

In [72]:
help(pd.DataFrame.fillna)

Help on function fillna in module pandas.core.frame:

fillna(self, value: 'Hashable | Mapping | Series | DataFrame' = None, *, method: 'FillnaOptions | None' = None, axis: 'Axis | None' = None, inplace: 'bool' = False, limit: 'int | None' = None, downcast: 'dict | None' = None) -> 'DataFrame | None'
    Fill NA/NaN values using the specified method.

    Parameters
    ----------
    value : scalar, dict, Series, or DataFrame
        Value to use to fill holes (e.g. 0), alternately a
        dict/Series/DataFrame of values specifying which value to use for
        each index (for a Series) or column (for a DataFrame).  Values not
        in the dict/Series/DataFrame will not be filled. This value cannot
        be a list.
    method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
        Method to use for filling holes in reindexed Series
        pad / ffill: propagate last valid observation forward to next valid
        backfill / bfill: use next valid observation to fill gap.
    axis : {0 or 'index', 1 or 'columns'}
        Axis along which to fill missing values. For `Series`
        this parameter is unused and defaults to 0.
    inplace : bool, default False
        If True, fill in-place. Note: this will modify any
        other views on this object (e.g., a no-copy slice for a column in a
        DataFrame).
    limit : int, default None
        If method is specified, this is the maximum number of consecutive
        NaN values to forward/backward fill. In other words, if there is
        a gap with more than this number of consecutive NaNs, it will only
        be partially filled. If method is not specified, this is the
        maximum number of entries along the entire axis where NaNs will be
        filled. Must be greater than 0 if not None.
    downcast : dict, default is None
        A dict of item->dtype of what to downcast if possible,
        or the string 'infer' which will try to downcast to an appropriate
        equal type (e.g. float64 to int64 if possible).

    Returns
    -------
    DataFrame or None
        Object with missing values filled or None if ``inplace=True``.

    See Also
    --------
    interpolate : Fill NaN values using interpolation.
    reindex : Conform object to new index.
    asfreq : Convert TimeSeries to specified frequency.

    Examples
    --------
    >>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
    ...                    [3, 4, np.nan, 1],
    ...                    [np.nan, np.nan, np.nan, np.nan],
    ...                    [np.nan, 3, np.nan, 4]],
    ...                   columns=list("ABCD"))
    >>> df
         A    B   C    D
    0  NaN  2.0 NaN  0.0
    1  3.0  4.0 NaN  1.0
    2  NaN  NaN NaN  NaN
    3  NaN  3.0 NaN  4.0

    Replace all NaN elements with 0s.

    >>> df.fillna(0)
         A    B    C    D
    0  0.0  2.0  0.0  0.0
    1  3.0  4.0  0.0  1.0
    2  0.0  0.0  0.0  0.0
    3  0.0  3.0  0.0  4.0

    We can also propagate non-null values forward or backward.

    >>> df.fillna(method="ffill")
         A    B   C    D
    0  NaN  2.0 NaN  0.0
    1  3.0  4.0 NaN  1.0
    2  3.0  4.0 NaN  1.0
    3  3.0  3.0 NaN  4.0

    Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
    2, and 3 respectively.

    >>> values = {"A": 0, "B": 1, "C": 2, "D": 3}
    >>> df.fillna(value=values)
         A    B    C    D
    0  0.0  2.0  2.0  0.0
    1  3.0  4.0  2.0  1.0
    2  0.0  1.0  2.0  3.0
    3  0.0  3.0  2.0  4.0

    Only replace the first NaN element.

    >>> df.fillna(value=values, limit=1)
         A    B    C    D
    0  0.0  2.0  2.0  0.0
    1  3.0  4.0  NaN  1.0
    2  NaN  1.0  NaN  3.0
    3  NaN  3.0  NaN  4.0

    When filling using a DataFrame, replacement happens along
    the same column names and same indices

    >>> df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
    >>> df.fillna(df2)
         A    B    C    D
    0  0.0  2.0  0.0  0.0
    1  3.0  4.0  0.0  1.0
    2  0.0  0.0  0.0  NaN
    3  0.0  3.0  0.0  4.0

    Note that column D is not affected since it is not present in df2.

In [73]:
df

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  NaN
2  3.0  5.0  7.0
3  4.0  6.0  NaN
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

In [74]:
df.fillna(method='ffill')

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  8.0
2  3.0  5.0  7.0
3  4.0  6.0  7.0
4  5.0  7.0  6.0
5  5.0  1.0  9.0
6  5.0  9.0  5.0

In [75]:
df.fillna(method='ffill', limit=1)

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  8.0
2  3.0  5.0  7.0
3  4.0  6.0  7.0
4  5.0  7.0  6.0
5  5.0  1.0  9.0
6  NaN  9.0  5.0

In [76]:
df.fillna(method='bfill', limit=1)

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  7.0
2  3.0  5.0  7.0
3  4.0  6.0  6.0
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

<h4> We can do more complicated operations using <code>applymap</code> and <code>apply</code>.</h4>

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Remark:</font> </h3>
    <p><code>applymap</code> is used to apply the same operation to <b>all the elements</b> of the dataframe.</p>
    
   <p><code>apply</code> is used to apply the same operation to <b>a row or column</b> of the dataframe.</p>
<br>
</div>

In [77]:
help(pd.DataFrame.apply)

Help on function apply in module pandas.core.frame:

apply(self, func: 'AggFuncType', axis: 'Axis' = 0, raw: 'bool' = False, result_type: "Literal['expand', 'reduce', 'broadcast'] | None" = None, args=(), **kwargs)
    Apply a function along an axis of the DataFrame.

    Objects passed to the function are Series objects whose index is
    either the DataFrame's index (``axis=0``) or the DataFrame's columns
    (``axis=1``). By default (``result_type=None``), the final return type
    is inferred from the return type of the applied function. Otherwise,
    it depends on the `result_type` argument.

    Parameters
    ----------
    func : function
        Function to apply to each column or row.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis along which the function is applied:

        * 0 or 'index': apply function to each column.
        * 1 or 'columns': apply function to each row.

    raw : bool, default False
        Determines if row or column is passed as a Series or ndarray object:

        * ``False`` : passes each row or column as a Series to the
          function.
        * ``True`` : the passed function will receive ndarray objects
          instead.
          If you are just applying a NumPy reduction function this will
          achieve much better performance.

    result_type : {'expand', 'reduce', 'broadcast', None}, default None
        These only act when ``axis=1`` (columns):

        * 'expand' : list-like results will be turned into columns.
        * 'reduce' : returns a Series if possible rather than expanding
          list-like results. This is the opposite of 'expand'.
        * 'broadcast' : results will be broadcast to the original shape
          of the DataFrame, the original index and columns will be
          retained.

        The default behaviour (None) depends on the return value of the
        applied function: list-like results will be returned as a Series
        of those. However if the apply function returns a Series these
        are expanded to columns.
    args : tuple
        Positional arguments to pass to `func` in addition to the
        array/series.
    **kwargs
        Additional keyword arguments to pass as keywords arguments to
        `func`.

    Returns
    -------
    Series or DataFrame
        Result of applying ``func`` along the given axis of the
        DataFrame.

    See Also
    --------
    DataFrame.applymap: For elementwise operations.
    DataFrame.aggregate: Only perform aggregating type operations.
    DataFrame.transform: Only perform transforming type operations.

    Notes
    -----
    Functions that mutate the passed object can produce unexpected
    behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
    for more details.

    Examples
    --------
    >>> df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
    >>> df
       A  B
    0  4  9
    1  4  9
    2  4  9

    Using a numpy universal function (in this case the same as
    ``np.sqrt(df)``):

    >>> df.apply(np.sqrt)
         A    B
    0  2.0  3.0
    1  2.0  3.0
    2  2.0  3.0

    Using a reducing function on either axis

    >>> df.apply(np.sum, axis=0)
    A    12
    B    27
    dtype: int64

    >>> df.apply(np.sum, axis=1)
    0    13
    1    13
    2    13
    dtype: int64

    Returning a list-like will result in a Series

    >>> df.apply(lambda x: [1, 2], axis=1)
    0    [1, 2]
    1    [1, 2]
    2    [1, 2]
    dtype: object

    Passing ``result_type='expand'`` will expand list-like results
    to columns of a Dataframe

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='expand')
       0  1
    0  1  2
    1  1  2
    2  1  2

    Returning a Series inside the function is similar to passing
    ``result_type='expand'``. The resulting column names
    will be the Series index.

    >>> df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)
       foo  bar
    0    1    2
    1    1    2
    2    1    2

    Passing ``result_type='broadcast'`` will ensure the same shape
    result, whether list-like or scalar is returned by the function,
    and broadcast it along the axis. The resulting column names will
    be the originals.

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')
       A  B
    0  1  2
    1  1  2
    2  1  2

In [78]:
help(pd.DataFrame.applymap)

Help on function applymap in module pandas.core.frame:

applymap(self, func: 'PythonFuncType', na_action: 'str | None' = None, **kwargs) -> 'DataFrame'
    Apply a function to a Dataframe elementwise.

    This method applies a function that accepts and returns a scalar
    to every element of a DataFrame.

    Parameters
    ----------
    func : callable
        Python function, returns a single value from a single value.
    na_action : {None, 'ignore'}, default None
        If ‘ignore’, propagate NaN values, without passing them to func.

        .. versionadded:: 1.2

    **kwargs
        Additional keyword arguments to pass as keywords arguments to
        `func`.

        .. versionadded:: 1.3.0

    Returns
    -------
    DataFrame
        Transformed DataFrame.

    See Also
    --------
    DataFrame.apply : Apply a function along input axis of DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])
    >>> df
           0      1
    0  1.000  2.120
    1  3.356  4.567

    >>> df.applymap(lambda x: len(str(x)))
       0  1
    0  3  4
    1  5  5

    Like Series.map, NA values can be ignored:

    >>> df_copy = df.copy()
    >>> df_copy.iloc[0, 0] = pd.NA
    >>> df_copy.applymap(lambda x: len(str(x)), na_action='ignore')
         0  1
    0  NaN  4
    1  5.0  5

    Note that a vectorized version of `func` often exists, which will
    be much faster. You could square each number elementwise.

    >>> df.applymap(lambda x: x**2)
               0          1
    0   1.000000   4.494400
    1  11.262736  20.857489

    But it's better to avoid applymap in that case.

    >>> df ** 2
               0          1
    0   1.000000   4.494400
    1  11.262736  20.857489

__Example:__ compute $f(x) = x^2+2x-1$ __for every element__ of the dataframe.

In [79]:
df.applymap(lambda x: x**2 + 2*x -1)

      x     y     z
0   2.0  14.0  79.0
1   7.0  23.0   NaN
2  14.0  34.0  62.0
3  23.0  47.0   NaN
4  34.0  62.0  47.0
5   NaN   2.0  98.0
6   NaN  98.0  34.0

We could of course use a named function:

In [80]:
def polynomial(x):
    return x**2 + 2*x -1

df.applymap(polynomial)

      x     y     z
0   2.0  14.0  79.0
1   7.0  23.0   NaN
2  14.0  34.0  62.0
3  23.0  47.0   NaN
4  34.0  62.0  47.0
5   NaN   2.0  98.0
6   NaN  98.0  34.0

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Remark:</font> </h3>
    <p>Note that the simplest way to do this sort of computation is to just perform the operations on the dataframe as a whole. Pandas takes care of broadcasting the operation to all the elements of the dataframe.</p>
</div>

In [81]:
polynomial(df)

      x     y     z
0   2.0  14.0  79.0
1   7.0  23.0   NaN
2  14.0  34.0  62.0
3  23.0  47.0   NaN
4  34.0  62.0  47.0
5   NaN   2.0  98.0
6   NaN  98.0  34.0

In [82]:
df**2 + 2*df -1

      x     y     z
0   2.0  14.0  79.0
1   7.0  23.0   NaN
2  14.0  34.0  62.0
3  23.0  47.0   NaN
4  34.0  62.0  47.0
5   NaN   2.0  98.0
6   NaN  98.0  34.0

Compute the Euclidean distance $f(x, y, z) =  \sqrt{x^2+y^2+z^2}$ __for every row__.

In [83]:
df

     x    y    z
0  1.0  3.0  8.0
1  2.0  4.0  NaN
2  3.0  5.0  7.0
3  4.0  6.0  NaN
4  5.0  7.0  6.0
5  NaN  1.0  9.0
6  NaN  9.0  5.0

In [84]:
# When we specify axis='columns' the apply method applies the function 
# along the columns to each row of df.
# row here is a dummy variable. 

def euclidean_dist(row):
    return np.sqrt(row['x']**2 + row['y']**2 + row['z']**2)

df.apply(euclidean_dist, axis='columns')

0     8.602325
1          NaN
2     9.110434
3          NaN
4    10.488088
5          NaN
6          NaN
dtype: float64

#### We can replace `NaNs` by 0 before doing the computation (if it makes sense for the problem at hand).

In [85]:
df.fillna(0).apply(euclidean_dist, axis='columns')

0     8.602325
1     4.472136
2     9.110434
3     7.211103
4    10.488088
5     9.055385
6    10.295630
dtype: float64

#### The same thing could be done via a `lambda` (anonymous) function.

In [86]:
df.fillna(0).apply(lambda row: np.sqrt(row['x']**2 + row['y']**2 + row['z']**2), 
                   axis='columns')

0     8.602325
1     4.472136
2     9.110434
3     7.211103
4    10.488088
5     9.055385
6    10.295630
dtype: float64

<div style="background-color:#FBEFFB;">
<p style="font-size:16px;color:#FF0080">&#0; When should you use a lambda function?</p>
<p>A lambda function is nothing more than a "normal" function without a specific name.</p>
<p>They are often used in array operations when a short function is applied only once in the code.</p>
<p>If you are using the same function multiple times, it's probably a good idea to define it using a <code>def</code> statement
and give it a proper name.</p>
</div>

#### Iterating over columns or rows is easy

In [87]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [88]:
for col in df.columns:
    print(df[col])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    NaN
Name: x, dtype: float64
0    3.0
1    4.0
2    5.0
3    6.0
4    7.0
5    1.0
6    9.0
Name: y, dtype: float64
0    8.0
1    NaN
2    7.0
3    NaN
4    6.0
5    9.0
6    5.0
Name: z, dtype: float64

Alternative syntax since by default the dataframe iterates over its rows:

In [89]:
for col in df:
    print(df[col])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    NaN
Name: x, dtype: float64
0    3.0
1    4.0
2    5.0
3    6.0
4    7.0
5    1.0
6    9.0
Name: y, dtype: float64
0    8.0
1    NaN
2    7.0
3    NaN
4    6.0
5    9.0
6    5.0
Name: z, dtype: float64

In [90]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [91]:
for row in df.index:
    print(df.loc[row])

x    1.0
y    3.0
z    8.0
Name: 0, dtype: float64
x    2.0
y    4.0
z    NaN
Name: 1, dtype: float64
x    3.0
y    5.0
z    7.0
Name: 2, dtype: float64
x    4.0
y    6.0
z    NaN
Name: 3, dtype: float64
x    5.0
y    7.0
z    6.0
Name: 4, dtype: float64
x    NaN
y    1.0
z    9.0
Name: 5, dtype: float64
x    NaN
y    9.0
z    5.0
Name: 6, dtype: float64

<div style="background-color:#FBEFFB;">
<p style="font-size:16px;color:#FF0080">&#0; What if the function I'm applying takes other parameters?</p>
<p>You can pass the value of any other parameter after the name of the function to the <code>apply</code> method.</p>
</div>

In [92]:
def minkowsky(row, p=2, verbose=False):
    if verbose:
        print('verbose')
    return (row['x']**p + row['y']**p + row['z']**p)**(1/p)

In [93]:
df.apply(minkowsky, axis='columns')

0     8.602325
1          NaN
2     9.110434
3          NaN
4    10.488088
5          NaN
6          NaN
dtype: float64

In [94]:
df.apply(minkowsky, p=1, axis='columns')

0    12.0
1     NaN
2    15.0
3     NaN
4    18.0
5     NaN
6     NaN
dtype: float64

In [95]:
df.apply(minkowsky, p=3, verbose=True, axis='columns')

verbose
verbose
verbose
verbose
verbose
verbose
verbose

0    8.143253
1         NaN
2    7.910460
3         NaN
4    8.810868
5         NaN
6         NaN
dtype: float64

<div>
<br>
<br>

<div style="background-color:#F7F2E0;">
<h1><font color=MediumVioletRed>Practice makes perfect.</font></h1>

Let <code>df</code> be the following dataframe:
<pre><code>
   A  B  C  D  E  F  G  H  I  J
x  3  6  2  5  6  3  2  7  2  8
y  7  1  3  2  3  7  8  8  8  9
z  8  2  8  5  1  4  6  8  4  2
</code></pre>

<code>df</code>  contains the <code>x</code> , <code>y</code> , and <code>z</code>  coordinates of 10 points labeled <code>A</code> to <code>J</code>.

<ol>
<li>Write a function <code>distance_from_A</code> that will take <code>df</code> as an argument and return a pandas  <code>Series</code> where the index is
the point label, and the value its distance from point A.</li>

<li>Write a function <code>distance_from_point</code> that will take <code>df</code> and a point (A, B, C,...) as an argument and return a pandas <code>Series</code> where the index is
the point label, and the value its distance from the point.</li>

<li>Test your functions on the dataframe defined below.</li>


</ol>
<br>
<b> Hints:</b>
<ul>
<li> You need to iterate over the columns and compute the distance from <code>A</code> for each point.</li>
<li> By default every column is a Pandas <code>Series</code> with both the values and an index. To get an array with just the values, use the <code>values</code> method of the <code>Series</code>. </li>
<li> To output a <code>Series</code>, you can collect your distances in a <code>list</code> and pass it to <code>pd.Series</code> to construct the <code>Series</code>.</li>
<li> Think about the index of the <code>Series</code> you output.</li>
</ul>
</div>
<br>
<br>
<br>
</div>

In [96]:
np.random.seed(12345)
df = pd.DataFrame(np.random.randint(1, 10, 30).reshape(3, 10), 
                  columns=['A','B','C','D','E','F','G','H','I','J'], 
                  index=['x', 'y', 'z'])
df

   A  B  C  D  E  F  G  H  I  J
x  3  6  2  5  6  3  2  7  2  8
y  7  1  3  2  3  7  8  8  8  9
z  8  2  8  5  1  4  6  8  4  2

<br>
<br>
<hr style="height:5px;border:none;color:#333;background-color:#333;" />
<div style="background-color:#F2FBEF;">
<h1><font color=#04B404>Self-paced learning: Panda</font></h1><br/>

<p>Work through chapters 5 and 6 of <b>PDA</b> by Wes McKinney.</p>
<p>You only need to go up to the section on JSON Data on p180.</p>

<p>If you do not understand something, check out the Pandas help (link in the Help menu at the top of the notebook).
If that does not clear things up, ask for help.</p>

<p><b>Do not simply copy and paste code into the notebook (unless it is a long array of numbers).</b></p>
<p><b>Type the code and
think about what you are doing. Make sure you understand what each part of the code does.</b></p>

<p>
You can create a new notebook for this, or you can create cells within this notebook. It is up to you. However, <b>be sure
to save and backup your work</b>.</p>

</div>

<div style="background-color:#F7F2E0;">
<h3> <font color=MediumVioletRed>Remark:</font> </h3>
<p>You should be able to access the book via the <a href="https://search.lib.uts.edu.au/permalink/61UTS_INST/19joism/alma991003616279705671">UTS Library</a></p>
</div>

<br>
<br>
<hr style="height:5px;border:none;color:#333;background-color:#333;" />
<h1>Practice, Practice, Practice</h1>
<ol>
<li> Work through the notebook again and make sure you understand <em>every concept and every line of code</em>.</li><br>
    
<li> Do the tutorial problems that you can find on Canvas.</li><br>

<li> Read  the snippet about <em>Reading Microsoft Excel Files</em> in <b>PDA</b>.</li><br>

<li> Work through the first seven sections of the pandas chapter of the <a href="http://nbviewer.jupyter.org/github/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.00-Introduction-to-Pandas.ipynb">Python Data Science Handbook</a> by Jake VanderPlas.</li><br>

</ol>


<hr style="height:5px;border:none;color:#333;background-color:#333;" />
<h1> Above &amp; Beyond</h1>

<ul>
<li>If you'd like to learn more about IPython (the interpreter) read chapter 2 of <b>Python for Data Analysis</b> by Wes McKinney, and chapter 1 of <a href="http://nbviewer.jupyter.org/github/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/01.00-IPython-Beyond-Normal-Python.ipynb">Python for Data Science</a> by Jake VanderPlas.</li><br>

<li>For more information on how indexing works in Pandas, have a look at the <a href="http://pandas.pydata.org/pandas-docs/stable/indexing.html">official documentation</a>.</li><br>

</ul>

> Material by Adel Rahmani